In [27]:
import pandas as pd
import numpy as np

In [28]:
s=pd.Series(["Sam",np.nan,"Tim","Kim"])
s

0    Sam
1    NaN
2    Tim
3    Kim
dtype: object

In [29]:
s.isnull()

0    False
1     True
2    False
3    False
dtype: bool

In [30]:
s.notnull()

0     True
1    False
2     True
3     True
dtype: bool

In [31]:
s[3]=None
s.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [32]:
s.dropna()

0    Sam
2    Tim
dtype: object

In [33]:
from numpy import nan as NA

In [34]:
df=pd.DataFrame([[1,2,3],[4,NA,5],
                 [NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [35]:
df.dropna()

     0    1    2
0  1.0  2.0  3.0

How parameter tells when to drop a row and all says only when all the elements of the row are NA

In [36]:
df.dropna(how="all")

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0

dropna does not alter the main table

In [37]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [38]:
df[1]=NA
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [39]:
df.dropna(axis=1,how="all")

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [40]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [54]:
df.dropna(thresh=3)

     0    1    2
0  1.0  2.0  3.0

In [42]:
df.fillna(0)

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [57]:
df.fillna({0:15,1:25,2:35})

      0     1     2
0   1.0   2.0   3.0
1   4.0  25.0   5.0
2  15.0  25.0  35.0

In [44]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [58]:
df.fillna(0,inplace=True)
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [46]:
df=pd.DataFrame([[1,2,3],[4,NA,5],
                 [NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [47]:
df.fillna(method="ffill")

C:\Users\Home\AppData\Local\Temp\ipykernel_4940\3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  2.0  5.0

limit tells the max number of charecters that can perform ffil

In [48]:
df.fillna(method="ffill",limit=1)

C:\Users\Home\AppData\Local\Temp\ipykernel_4940\1059200199.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill",limit=1)

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  NaN  5.0

In [49]:
data=pd.Series([1,0,NA,5])
data

0    1.0
1    0.0
2    NaN
3    5.0
dtype: float64

fill the empty cells with the mean

In [50]:
data.fillna(data.mean())

0    1.0
1    0.0
2    2.0
3    5.0
dtype: float64

In [51]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [59]:
df.fillna(df.mean())

     0    1    2
0  1.0  2.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0